cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

brew "mas"

mas "1Password", id: 1333542190
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

mas "Ulysses", id: 1225570693
mas "Pixelmator Pro", id: 1289583905
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
mas "GarageBand", id: 682658836
mas "Mactracker", id: 430255202
mas "Whatsapp", id: 1147396723
mas "Slack", id: 803453959
mas "Spark", id: 1176895641

# Development
mas "Xcode", id: 497799835
mas "Developer", id: 640199958

brew "carthage"
brew "fastlane", link: false
brew "git-lfs"
brew "sourcery"
brew "swiftlint"
brew "node"
brew "mysql"
brew 'ffmpeg'

cask "visual-studio-code"
cask "tower"
cask "dash"
cask "postman"
cask "sequel-pro"
cask "mysqlworkbench"
cask "proxyman"
cask "font-jetbrains-mono"

# Utilities
cask "iterm2"
cask "alfred"
cask "expressvpn"
cask "grandperspective"
cask "vlc"
cask "istat-menus"
cask "forecast"
cask "keycastr"
cask "transmission"
cask "karabiner-elements"
cask "xcodes"
cask "teamviewer"

# Communications
cask "skype"
cask "google-chrome"
cask "zoom"
cask "discord"

# - Gadgets
cask "obs"
cask "elgato-stream-deck"
cask "logitech-g-hub"
cask "philips-hue-sync"

# - Other
cask "raspberry-pi-imager"
cask "ultimaker-cura"

# Pico
# brew "cmake"
# tap "ArmMbed/homebrew-formulae"
# brew "arm-none-eabi-gcc"
